const messages = {
  // signup
  unknown: () => "Я тебя не понимаю, попробуй еще раз",
  start: () =>
    "Привет❗️👋🏼\nМеня зовут Соник😉 И я рад видеть тебя в нашей компании 🤗\nС моей помощью ты сможешь быстро адаптироваться и стать классным специалистом 😎",
  firstName: () => "Для начала расскажи, как тебя зовут?",
  lastName: () => "Очень приятно! А фамилия у тебя какая?",
  department: () => "Выбери свой филиал",
  hobbies: () =>
    "Что ж, так и запишем! Сейчас самое главное....\n\nРасскажи подробно о своих: \nХобби\nУвлечениях\nИнтересах\nПредпочтениях\n\nНапример: какие любимые виды досуга, спорта, культурные мероприятия и т д \n\nПиши все, что поможет мне лучше узнать тебя!",
  age: () =>
    "Очень здорово!\n\nТвои ответы будут доступны совету молодых ученых и специалистов, а также председателям профсоюза, чтобы они могли лучше узнать тебя и предложить интересные мероприятия, инициативы и возможности, соответствующие твоим интересам. \n\nНапоследок, сколько тебе лет?",
  incorrectAge: () => "Вводи только цифры!",
  young: () =>
    "Ну, теперь я знаю о тебе все что нужно!\n\nС радостью поздравляю тебя с вступлением совета молодых ученых и специалистов!🥳🥳🥳\n\nЖелаю успешной работы в нашей компании и надеюсь на нашу дружбу!\n\nПоехали!😎",
  oldMan: () =>
    "Хоть ты и не молодой работник, но я все равно готов поделиться с тобой полезной информацией 😉\n\nПоехали!😎",
  // main
  main: () => "С чего начнем?",
  yourStart: () => "Твой старт",
  allAboutGTE: () => "Все о ГТЕ",
  possibilities: () => "Возможности",
  useful: () => "Полезно",
  eventsSchedule: () => "График мероприятий",
  faq: () => "Вопрос ответ",
  idea: () => "Есть идея или вопрос",
};

module.exports = { messages };
